"""
学习目标：
    1. 了解关系型数据库的诞生原因、优势
    2. MySQL 数据库的安装和初始化
    3. 学习管理MySQL 服务
    4. 创建新用户，并分配权限
    5. 了解MySQL 常用配置参数
"""

"""
数据库系统（DBMS）：是指一个能为用户提供信息服务的系统。
                它实现了有组织地、动态地存储大量相关数据的功能，
                提供了数据处理和信息资源共享的便利手段。
"""

"""
关系型数据库系统（RDBMS）：是指采用了关系模型的数据库系统。
                        关系模型中，数据是分类存放的，数据之间可以有联系。
                        主流的关系型数据库: Oracle、MySQL、SQL Server、DB2
"""

"""
NoSQL 数据库：指的是数据分类存放，但是数据之间没有关联关系的数据库系统。
            主流的NoSQL 数据库：Redis、MongoDB、MenCache、Neo4J
"""

# mysql 的用户管理
